doc/UBERALLFS.org
#+TITLE: Uberallfs
#+AUTHOR: Christian Thäter
#+EMAIL: ct@pipapo.org
#+LANGUAGE: en
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper, hidelinks]
#+LATEX_HEADER: \usepackage{enumitem}
#+LATEX_HEADER: \setlist[description]{style=nextline}
#+LATEX_HEADER: \parskip8pt
#+LATEX_HEADER: \parindent0


* Overview

** The Idea

   Uberallfs is a peer to peer distributed filesystem. Objects are cached on the accessing
   node. Mutation is implemented by passing Tokens around. Only the owner of the Token is
   eligible to mutate the data. This token can be requested from the current token holder by any
   entity which has permission to mutate the object. The old Token holder will then keep a
   reference to the entity which received the token. These references can then be walked to
   find the authoritative node at the end of the list. The actual implementation of this Idea
   becomes a bit more complex and offers certain optimization opportunities.

   Entities who don't have 'write' access do an object will never get the token. When read
   access is requested they synchronize the object with the nodes who hold the original
   data. This synchronization is managed by the current token owner.

   [[#ead96b87-abaf-43e6-89a8-111b9a8799d3][Look here for examples how to use it]]

** Features and Goals

*** Caching and pinning objects
    Objects become cached upon access. There will be tools to enforce this caching and pin
    objects to a node.

*** Offline use
    The filesystem caches objects and can be used when a node is offline. For writes this
    needs either the token to be locally obtained or the object can become 'detached' and
    changes need to be merged when connectivity is restored (which can be automatic if there
    are no conflicts).

*** Strong security and anonymity available
    Objects can be either instantiated by a 'creator' who defines security policies about who
    has access to them OR published as anonymous/immutable.

*** mixed in private data
    Objects may be private only and never be shared.

*** redundant storage
    Different levels of redundancy are planned, raid1 like redundancy where sync/close calls
    only complete after the data is replicated or lazy backup schemes where data becomes
    syncronized at lower priority without blocking current access.

*** Garbage collection / Balancing
    When space becomes scarce unused objects can be evicted from the cache. Either if this is
    just a copy (that is not used for redundancy) by deleting the object or by offering
    objects to other nodes within a configured realm of hosts.

*** Striped parallel downloads
    If possible (later) Object transfer and syncronization can be spread over multiple peers
    to utilize better bandwidth sharing (Bittorrent alike).


** Design Choices
   Uberallfs uses 'opinionated' Design. Protocols include a single version number which fully
   defines the properties, sizes and algorithms used. Future versions will be backward
   compatible to few older versions but eventually old versions will become unsupported (which
   may happen earlier when there are security related problems).

   Version O is always defined to be 'experimental' it will be used in closed environments for
   testing and development, never in production. Any Version 0 Protocol outside of this
   environment is considered incompatible with itself.

* Components

  Following a coarse overview of the components making uberallfs. Details are described in
  later Chapters.

** Object Store

   At the core is a object store where all filesystem objects are cached. Later support for
   volatile objects is planned to allow once used streaming data. [[#bd6e60d2-31a6-46f8-87ec-173f395ef49b][For Details see below]].

** Frontends

   User-access to the underlying filesystem hierarchy. The primary goal is a Linux fuse
   filesystem which maps the underlying uberallfs to an ordinary POSIX conforming filesystem.

   Later other front ends are planned. Android storage framework for example.

** Object Discovery

   As described in the introduction, the 'trail' pointer used to locate the node which is
   authoritative for a filesystem object is the main concept of uberallfs. Still there needs
   to be more to make this functional. For example Objects need to be recovered when the trail
   got broken (lost node). Only nodes which have full access to an object are allowed to
   become authoritative.

   When a node becomes authoritative this does not mean that the data is available there, it
   only manages the 'ownership'. The object metadata contains references to nodes who
   actually hold the data. For reading the data will be synchronized. While writing only
   invalidates the old references and instantiates new data locally.

   Nodes without full access to objects can synchronize data as far they have permissions to
   do so and negotiate promises and leases with the authoritative node for race free data
   access.

** Object Synchronization

   Once access/authority to an object is granted the data may be synchronized (for reads).
   For this maps of byte-ranges and version/generation counts are used. There is no need for
   rsync like checksumming since the authoritative always knows which data is changed/recent.

   Objects may become scattered across the nodes when frequent random writes at different
   locations of an object happen. This is mitigated by a low priority object coalescing which
   gather fragments and merges them on single nodes.

** Access Control

   Access control is implemented over public keys and signatures. The node which is
   authoritative over an object is responsible for enforcing the permissions. Access control
   metadata is sufficient enough to be freestanding without any additional information. Still
   due to the distributed nature there are some loopholes that can not be closed (discussed
   below). Basically any access ever granted can not be reliably revoked at a later time.

   [[#62c4e059-5538-48a1-953a-43c1c9a5d7fb][Details below.]]

** Network / Sessions

   A node establishes a session with another node on behalf of a user/key. Each session is
   then authenticated for this keys which is used for access control. Sessions are keep state
   for some operations. As long a session is alive these states are valid. When a session dies
   unexpectedly then these states and all associated data gets cleaned up/rolled back.

   [[#d2f3ef15-6e9a-4cae-9131-1534664ffa98][Handled by the Node]].

** Node Discovery

   Nodes are addressed by their public keys. The last seen addresses and names of other nodes
   are cached for fast lookup. If that fails then a discovery is initiated (Details to be
   worked out).

