doc/UBERALLFS.md

# Table of Contents

1.  [Overview](#orgd0f6077)
    1.  [The Idea](#orgfb93553)
    2.  [Features and Goals](#orgcbc5660)
        1.  [Caching and pinning objects](#org17ce620)
        2.  [Offline use](#org5b69cff)
        3.  [Strong security and anonymity available](#org87939f9)
        4.  [mixed in private data](#orgcbe16b6)
        5.  [redundant storage](#org6cebcf3)
        6.  [Garbage collection / Balancing](#org1c69d2a)
        7.  [Striped parallel downloads](#org0ad2611)
    3.  [Design Choices](#orgaa4646f)
2.  [Components](#orgba78ead)
    1.  [Object Store](#org806801a)
    2.  [Frontends](#orgcdec77a)
    3.  [Object Discovery](#org9cfbc76)
    4.  [Object Synchronization](#org4ee21f7)
    5.  [Access Control](#orgc99227a)
    6.  [Network / Sessions](#org965f4ea)
    7.  [Node Discovery](#orgc164494)
    8.  [Key Management](#org9590750)
    9.  [Distributed PKI](#orge249891)
3.  [Object Store](#bd6e60d2-31a6-46f8-87ec-173f395ef49b)
    1.  [Identifier Types](#org4e2ae15)
        1.  [Plans](#org762556d)
    2.  [Object Types](#org01437fd)
        1.  [tree](#org45de736)
        2.  [blob](#orgc4effff)
        3.  [part](#orgec5176e)
    3.  [Metadata Types](#org822ae0b)
        1.  [perm](#orga0c53f9)
        2.  [meta](#org4571861)
        3.  [dmap](#orgf33cacd)
        4.  [hash](#orga8f8573)
        5.  [link](#orgcacccab)
        6.  [rule](#org30274c9)
    4.  [Ideas](#org5f8e319)
4.  [Disk Layout](#org6cbbc3d)
    1.  [objectstore](#org17e2c4a)
    2.  [node](#org2932388)
    3.  [fuse](#org4a89f68)
5.  [Access Control](#62c4e059-5538-48a1-953a-43c1c9a5d7fb)
    1.  [Brainstorm/Ideas](#org3eec286)
    2.  [Security Implications](#orgb759839)
        1.  [replay attack](#org6b4d770)
        2.  [malicious object mutation](#orgd7e8943)
        3.  [privilege escalation](#org5a1a758)
        4.  [Object persistence](#org2332ef3)
    3.  [Concise Permissions](#org523d29b)
        1.  [File Permissions](#org3e19ea1)
        2.  [Directory Permissions](#org8cce863)
6.  [The Node](#d2f3ef15-6e9a-4cae-9131-1534664ffa98)
    1.  [Planned](#orge12fb2c)
        1.  [Realms](#orgce1d9c8)
7.  [HowTo](#ead96b87-abaf-43e6-89a8-111b9a8799d3)
    1.  [Plumbing vs Porcelain](#orgc13818d)
        1.  [Initialize and start a new uberallfs node](#org7f9170c)
8.  [Problems/Solutions](#org4b07c2b)
    1.  [Distributed object deletion](#orga8cc0d6)



<a id="orgd0f6077"></a>

# Overview


<a id="orgfb93553"></a>

## The Idea

Uberallfs is a peer to peer distributed filesystem. Objects are cached on the accessing
node. Mutation is implemented by passing Tokens around. Only the owner of the Token is
eligible to mutate the data. This token can be requested from the current token holder by any
entity which has permission to mutate the object. The old Token holder will then keep a
reference to the entity which received the token. These references can then be walked to
find the authoritative node at the end of the list. The actual implementation of this Idea
becomes a bit more complex and offers certain optimization opportunities.

Entities who don't have 'write' access do an object will never get the token. When read
access is requested they synchronize the object with the nodes who hold the original
data. This synchronization is managed by the current token owner.

[Look here for examples how to use it](#ead96b87-abaf-43e6-89a8-111b9a8799d3)


<a id="orgcbc5660"></a>

## Features and Goals


<a id="org17ce620"></a>

### Caching and pinning objects

Objects become cached upon access. There will be tools to enforce this caching and pin
objects to a node.


<a id="org5b69cff"></a>

### Offline use

The filesystem caches objects and can be used when a node is offline. For writes this
needs either the token to be locally obtained or the object can become 'detached' and
changes need to be merged when connectivity is restored (which can be automatic if there
are no conflicts).


<a id="org87939f9"></a>

### Strong security and anonymity available

Objects can be either instantiated by a 'creator' who defines security policies about who
has access to them OR published as anonymous/immutable.


<a id="orgcbe16b6"></a>

### mixed in private data

Objects may be private only and never be shared.


<a id="org6cebcf3"></a>

### redundant storage

Different levels of redundancy are planned, raid1 like redundancy where sync/close calls
only complete after the data is replicated or lazy backup schemes where data becomes
syncronized at lower priority without blocking current access.


<a id="org1c69d2a"></a>

### Garbage collection / Balancing

When space becomes scarce unused objects can be evicted from the cache. Either if this is
just a copy (that is not used for redundancy) by deleting the object or by offering
objects to other nodes within a configured realm of hosts.


<a id="org0ad2611"></a>

### Striped parallel downloads

If possible (later) Object transfer and syncronization can be spread over multiple peers
to utilize better bandwidth sharing (Bittorrent alike).


<a id="orgaa4646f"></a>

## Design Choices

Uberallfs uses 'opinionated' Design. Protocols include a single version number which fully
defines the properties, sizes and algorithms used. Future versions will be backward
compatible to few older versions but eventually old versions will become unsupported (which
may happen earlier when there are security related problems).

Version O is always defined to be 'experimental' it will be used in closed environments for
testing and development, never in production. Any Version 0 Protocol outside of this
environment is considered incompatible with itself.


<a id="orgba78ead"></a>

# Components

Following a coarse overview of the components making uberallfs. Details are described in
later Chapters.


<a id="org806801a"></a>

## Object Store

At the core is a object store where all filesystem objects are cached. Later support for
volatile objects is planned to allow once used streaming data. [For Details see below](#bd6e60d2-31a6-46f8-87ec-173f395ef49b).


<a id="orgcdec77a"></a>

## Frontends

User-access to the underlying filesystem hierarchy. The primary goal is a Linux fuse
filesystem which maps the underlying uberallfs to an ordinary POSIX conforming filesystem.

Later other front ends are planned. Android storage framework for example.


<a id="org9cfbc76"></a>

## Object Discovery

As described in the introduction, the 'trail' pointer used to locate the node which is
authoritative for a filesystem object is the main concept of uberallfs. Still there needs
to be more to make this functional. For example Objects need to be recovered when the trail
got broken (lost node). Only nodes which have full access to an object are allowed to
become authoritative.

When a node becomes authoritative this does not mean that the data is available there, it
only manages the 'ownership'. The object metadata contains references to nodes who
actually hold the data. For reading the data will be synchronized. While writing only
invalidates the old references and instantiates new data locally.

Nodes without full access to objects can synchronize data as far they have permissions to
do so and negotiate promises and leases with the authoritative node for race free data
access.


<a id="org4ee21f7"></a>

## Object Synchronization

Once access/authority to an object is granted the data may be synchronized (for reads).
For this maps of byte-ranges and version/generation counts are used. There is no need for
rsync like checksumming since the authoritative always knows which data is changed/recent.

Objects may become scattered across the nodes when frequent random writes at different
locations of an object happen. This is mitigated by a low priority object coalescing which
gather fragments and merges them on single nodes.


<a id="orgc99227a"></a>

## Access Control

Access control is implemented over public keys and signatures. The node which is
authoritative over an object is responsible for enforcing the permissions. Access control
metadata is sufficient enough to be freestanding without any additional information. Still
due to the distributed nature there are some loopholes that can not be closed (discussed
below). Basically any access ever granted can not be reliably revoked at a later time.

[Details below.](#62c4e059-5538-48a1-953a-43c1c9a5d7fb)


<a id="org965f4ea"></a>

## Network / Sessions

A node establishes a session with another node on behalf of a user/key. Each session is
then authenticated for this keys which is used for access control. Sessions are keep state
for some operations. As long a session is alive these states are valid. When a session dies
unexpectedly then these states and all associated data gets cleaned up/rolled back.

[Handled by the Node](#d2f3ef15-6e9a-4cae-9131-1534664ffa98).


<a id="orgc164494"></a>

## Node Discovery

Nodes are addressed by their public keys. The last seen addresses and names of other nodes
are cached for fast lookup. If that fails then a discovery is initiated (Details to be
worked out).
