doc/UBERALLFS.org
** Key Management

   creates user and node keys, manages signatures/pki,
   key-agent process.

** Distributed PKI

   Future versions will include a distributed public key infrastructure. This augments the
   exiting Access control with more advanced features like:
    - web of trust for confirming identity and credibility of other keys
    - revoking signatures
    - key aliasing/delegation
    - key renewal.

* Object Store
  :PROPERTIES:
  :CUSTOM_ID: bd6e60d2-31a6-46f8-87ec-173f395ef49b
  :END:

  While uberallfs looks like a hierarchical filesystem, the backend store is a flat key/value
  object store. The keys are derived from universally unique and secure identifiers. Secure in
  this context means that not entity can create a collision that goes unnoticed. These
  identifiers resemble global unique inode numbers.

  There are different object types of objects stored under a key, explained later in this
  document. The main parts are the 'tree' and 'blob' types. A 'tree' is an object that holds
  named references to sub-object keys much like a directory in a filesystem. Blob objects
  contain the file data. Other types contain metadata for security and distribution.

  A mounted uberallfs uses a 'tree' object as the root of the mountpoint. From
  there on a hierarchy like with any other filesystem is created.

  The difference here is that all objects can be distributed over the network and anyone (with
  permission to access the object) can references them within his own hierarchy. This for
  example allows a complete home directory to be shared as well as mounting the same object
  (directory) under different names at different positions in the hierarchy. For example one
  instance may name a directory './Work/' and another one refers to the same tree object as
  './Arbeit/'.

  Eventually (if one is careless) this could lead to directory cycles, which is the major
  difference to traditional filesystems where directory cycles are highly disregarded.

** Identifier Types

   A mutable objects are identified by a unique (random) number while an immutable object is
   identified by a hash over its content. Objects which are constrained by permissions a
   digital signature is required to guarantee integrity (see below).

   We can further deduce the necessity of 3 scopes where these keys are valid:
   1. private objects that must never be shared but is accessible to the local instance
   2. public objects that have ownership and access permissions
   3. anonymous objects without any ownership and public access

   This leads to following 4 types of identifiers:

   |           | private | public           | anonymous |
   |-----------+---------+------------------+-----------|
   | mutable   | random  | random signature | ¹         |
   | immutable | ²       | hash signature   | hash      |

   Note that there are 2 not supported combinations:
   1. Anonymous mutable data would lead security problems like denial of service attacks
   2. Having immutable private objects won't have any security implications and may be
      supported at some point when need arises (eg. deduplication)

   Eventually some more Types might be supported, for example hashing could be indirect being
   the hash over a bittorrent like list of hashes. This may even become the default for
   immutable objects at some point.

*** Plans

    Later file encryption might be added. This is not directly on topic for uberallfs as
    objects are only distributed to nodes that are allowed to (at least) read them. File
    encryption would remove this requirement and allow proxying/caching on nodes that which
    don't have access to the object.

** Object Types

   Details explained in the next chapter.

*** tree
    Stores references to other objects (trees, blobs, symlinks) May store Unix special files
    (fifo, sockets, device nodes) initially private, eventually network transparent nodes may
    be implemented.

*** blob
    The actual object (file) data.
    can be sparse/incomplete with not yet synchronized data.

*** part
    WIP: parts of blobs with own identifiers.

** Metadata Types

*** perm
    Security manifest, access control and security related metadata.

*** meta
    Extra metadata about authority/trail/generation/distribution.

*** dmap
    Maps to the nodes holding the data for mutable files. Initially only complete objects,
    later byte ranges/multi node.

*** hash
    Torrent like hash list for immutable files.

*** link

    When an object type changes, its identifier changes. This .link type is then a pointer to
    the new identifier.

*** rule

    - Size restrictions for files.
    - Accepted filename patterns.
    - dirs/files only.
    - Change the properties/identifier of a file, eg. a when a '.mkv.part' file becomes
      renamed to '.mkv' its type is changed to 'public immutable'.

    It is planned to make a simple rule engine that automates policies on objects (mostly
    directories). For example:

** Ideas

   Keep lazy stats (coarse granularity, infrequently written to disk, with risk of loosing data in a crash)

   - atime :: know when the object was last used
   - afreq :: average frequency of use (rolling average?)


* Disk Layout

  There are (so far) three main components which need to be visible on the host
  filesystem. These are designed to be in the same place (shared directory) as well as in
  different places with the components shared over several uberallfs instances.

  The basic use case is that all data resides in a single directory which also serves as
  mountpoint for the fuse filesystem, thus shadowing they underlying data.

** objectstore

   The objectstore can be freestanding/self contained no external configuration is needed.

   - objects/ :: used for the objectstore
   - objects/??/ :: any 2 character dir is used for the first level (4096 dirs, base64)
   - objects/root/ :: symlink to the root dir object
   - objects/tmp/ :: for safe tempfile handling
   - objects/delete/ :: deleted objects with some grace period
   - objects/volatile :: can be a tmpfs for temporary objects
   - objects/volatile/??/ :: any 2 character dir is used for the first level (4096 dirs)
   - config/ :: configuration files
   - objectstore.version :: version identifier

   Planned: links to other objectstores on local computer, possibly on slower media for archives.

** node

   The 'node' manages the data distribution between other nodes, forming a peer to peer network.

   For that it keeps the networks addresses of other nodes and manages network related keys.

   - config/ :: configuration files
   - nodes/??/ :: information about other nodes
   - keystore/ ::
     some of the keys used to operate the node. Others may be in ~/.config/uberallfs and are
     loaded on startup. Private keys will be isolated, TBD.
   - uberallfs.sock :: socket for local node control
   - node.version :: version identifier

** fuse

   When fuse gets mounted it may shadow all of the above and present POSIX compatible
   file system.  Only files starting with '.uberallfs.' at the root are reserved (control
   socket etc).

