doc/UBERALLFS.md


<a id="org9590750"></a>

## Key Management

creates user and node keys, manages signatures/pki,
key-agent process.


<a id="orge249891"></a>

## Distributed PKI

Future versions will include a distributed public key infrastructure. This augments the
exiting Access control with more advanced features like:

-   web of trust for confirming identity and credibility of other keys
-   revoking signatures
-   key aliasing/delegation
-   key renewal.


<a id="bd6e60d2-31a6-46f8-87ec-173f395ef49b"></a>

# Object Store

While uberallfs looks like a hierarchical filesystem, the backend store is a flat key/value
object store. The keys are derived from universally unique and secure identifiers. Secure in
this context means that not entity can create a collision that goes unnoticed. These
identifiers resemble global unique inode numbers.

There are different object types of objects stored under a key, explained later in this
document. The main parts are the 'tree' and 'blob' types. A 'tree' is an object that holds
named references to sub-object keys much like a directory in a filesystem. Blob objects
contain the file data. Other types contain metadata for security and distribution.

A mounted uberallfs uses a 'tree' object as the root of the mountpoint. From
there on a hierarchy like with any other filesystem is created.

The difference here is that all objects can be distributed over the network and anyone (with
permission to access the object) can references them within his own hierarchy. This for
example allows a complete home directory to be shared as well as mounting the same object
(directory) under different names at different positions in the hierarchy. For example one
instance may name a directory './Work/' and another one refers to the same tree object as
'./Arbeit/'.

Eventually (if one is careless) this could lead to directory cycles, which is the major
difference to traditional filesystems where directory cycles are highly disregarded.


<a id="org4e2ae15"></a>

## Identifier Types

A mutable objects are identified by a unique (random) number while an immutable object is
identified by a hash over its content. Objects which are constrained by permissions a
digital signature is required to guarantee integrity (see below).

We can further deduce the necessity of 3 scopes where these keys are valid:

1.  private objects that must never be shared but is accessible to the local instance
2.  public objects that have ownership and access permissions
3.  anonymous objects without any ownership and public access

This leads to following 4 types of identifiers:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">private</th>
<th scope="col" class="org-left">public</th>
<th scope="col" class="org-left">anonymous</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">mutable</td>
<td class="org-left">random</td>
<td class="org-left">random signature</td>
<td class="org-left">¹</td>
</tr>


<tr>
<td class="org-left">immutable</td>
<td class="org-left">²</td>
<td class="org-left">hash signature</td>
<td class="org-left">hash</td>
</tr>
</tbody>
</table>

Note that there are 2 not supported combinations:

1.  Anonymous mutable data would lead security problems like denial of service attacks
2.  Having immutable private objects won't have any security implications and may be
    supported at some point when need arises (eg. deduplication)

Eventually some more Types might be supported, for example hashing could be indirect being
the hash over a bittorrent like list of hashes. This may even become the default for
immutable objects at some point.


<a id="org762556d"></a>

### Plans

Later file encryption might be added. This is not directly on topic for uberallfs as
objects are only distributed to nodes that are allowed to (at least) read them. File
encryption would remove this requirement and allow proxying/caching on nodes that which
don't have access to the object.


<a id="org01437fd"></a>

## Object Types

Details explained in the next chapter.


<a id="org45de736"></a>

### tree

Stores references to other objects (trees, blobs, symlinks) May store Unix special files
(fifo, sockets, device nodes) initially private, eventually network transparent nodes may
be implemented.


<a id="orgc4effff"></a>

### blob

The actual object (file) data.
can be sparse/incomplete with not yet synchronized data.


<a id="orgec5176e"></a>

### part

WIP: parts of blobs with own identifiers.


<a id="org822ae0b"></a>

## Metadata Types


<a id="orga0c53f9"></a>

### perm

Security manifest, access control and security related metadata.


<a id="org4571861"></a>

### meta

Extra metadata about authority/trail/generation/distribution.


<a id="orgf33cacd"></a>

### dmap

Maps to the nodes holding the data for mutable files. Initially only complete objects,
later byte ranges/multi node.


<a id="orga8f8573"></a>

### hash

Torrent like hash list for immutable files.


<a id="orgcacccab"></a>

### link

When an object type changes, its identifier changes. This .link type is then a pointer to
the new identifier.


<a id="org30274c9"></a>

### rule

-   Size restrictions for files.
-   Accepted filename patterns.
-   dirs/files only.
-   Change the properties/identifier of a file, eg. a when a '.mkv.part' file becomes
    renamed to '.mkv' its type is changed to 'public immutable'.

It is planned to make a simple rule engine that automates policies on objects (mostly
directories). For example:


<a id="org5f8e319"></a>

## Ideas

Keep lazy stats (coarse granularity, infrequently written to disk, with risk of loosing data in a crash)

-   **atime:** know when the object was last used
-   **afreq:** average frequency of use (rolling average?)


<a id="org6cbbc3d"></a>

# Disk Layout

There are (so far) three main components which need to be visible on the host
filesystem. These are designed to be in the same place (shared directory) as well as in
different places with the components shared over several uberallfs instances.

The basic use case is that all data resides in a single directory which also serves as
mountpoint for the fuse filesystem, thus shadowing they underlying data.


<a id="org17e2c4a"></a>

## objectstore

The objectstore can be freestanding/self contained no external configuration is needed.

-   **objects/:** used for the objectstore
-   **objects/??/:** any 2 character dir is used for the first level (4096 dirs, base64)
-   **objects/root/:** symlink to the root dir object
-   **objects/tmp/:** for safe tempfile handling
-   **objects/delete/:** deleted objects with some grace period
-   **objects/volatile:** can be a tmpfs for temporary objects
-   **objects/volatile/??/:** any 2 character dir is used for the first level (4096 dirs)
-   **config/:** configuration files
-   **objectstore.version:** version identifier

Planned: links to other objectstores on local computer, possibly on slower media for archives.


<a id="org2932388"></a>

## node

The 'node' manages the data distribution between other nodes, forming a peer to peer network.

For that it keeps the networks addresses of other nodes and manages network related keys.

-   **config/:** configuration files
-   **nodes/??/:** information about other nodes
-   **keystore/:** some of the keys used to operate the node. Others may be in ~/.config/uberallfs and are
    loaded on startup. Private keys will be isolated, TBD.
-   **uberallfs.sock:** socket for local node control
-   **node.version:** version identifier


<a id="org4a89f68"></a>

## fuse

When fuse gets mounted it may shadow all of the above and present POSIX compatible
file system.  Only files starting with '.uberallfs.' at the root are reserved (control
socket etc).
