doc/UBERALLFS.org
* Access Control
  :PROPERTIES:
  :CUSTOM_ID: 62c4e059-5538-48a1-953a-43c1c9a5d7fb
  :END:

  The 'perm' object type contains all metadata necessary for access control for the associated object. Any
  node is obliged to validate access rights on queries.

  - Identification ::

    We must ensure that an Object Key and Identifier belongs to the Object in question and
    all following security metadata needs to be derived from this in a provable way. All
    public keys can be constrained by an expire date.

    - Identifier ::
      A random number.
    - Creator ::
      Public key of the Creator/expiration of this object. Can be only once used key which is
      deleted after initialization of the metadata. The expiration date here becomes part of
      the identifier. Once passed the object becomes invalid and can be purged.
    - Identifier Signature ::
      The Identifier is signed with the Creators key.
    - Object Key ::
      The Identifier and its Signature are hashed together to give the key used in the
      object store. This is not stored in the 'perm' object as it is the 'name' thereof
      itself.

  - Administrative Lists ::
    - Super Admins ::
      A (optional) list of public key/expire tupes that are allowed to modify the
      per-permission admins below.
      - Super Admins Signature ::
        The list of Super-Admins together with a nonce and the Identifier becomes signed by
        the Creator. This indirection allows to dispose the Creator key now and to delegate
        administrative task to multiple entities. Caveat: after the Creator key is disposed
        the Super-Admin list can not be changed anymore.

    - Per Permission Admins ::
      Optional list for each possible permission (read, write, delete, append, ...). Keys
      listed in these lists are allowed to modify the respective ACL's below. (idea:
      permission tags on the lists itself: an admin may add/delete...)
      - Per Permission Admins Signature ::
        Each of the lists above needs to be signed by the Creator or a Super-Admin.
        This signature contains a nonce and the Identifier as well

  - Access Control Lists ::
    Optional list for each possible permission (read, write, delete, append, ...). Keys
    listed in these lists are allowed to access the object in requested way.
    - ACL Signature ::
      Each of the lists above needs to be signed by the Creator or a Super-Admin or a
      matching per-permission-Admin. This signature contains a nonce and the Identifier as
      well.

  - Generation Count and Signature ::
    Whenever any data on the above got changed a generation counter is incremented and the
    all list blocks plus this generation counter must be signed by one of the above
    administrative Keys (usually the one who did the change).


  TODO: creation date and expire parameters are required, shall these be signed here?

** Brainstorm/Ideas

   - Quorum :: M of N Admins must grant permission to be effective

   - Key revocation :: special tree object which holds revoked signatures, must be safe
     against DoS, needs some thinking.


** Security Implications

*** replay attack

    TBD: in short one who once had (administrative) access to the object can replay that old
    version of the metadata under some conditions since the 'trail' and generation count can
    be incomplete. (write example how this can happen, any solution for this?)

    1. A creates a file with B and C as Admin
    2. B takes the token from A   A->B
    3. C takes the token from B   A->B->C
    4. C removes B from an Administrative list
    5. B takes the token from C back  A->B<-C
    6. B replays the 'perm' metadata from 2. (gains Admin back)
    7. A takes the file from B but can not discover the tampering

    The only 'weak' protection against this are the expiration dates. When these are short
    enough they limit the time window in which such an attack can be done and constrain the
    necessary lifetime for signature revocations.

*** malicious object mutation

    Can not happen because the token will never be given to a node that won't have write access.

      
*** privilege escalation


      
*** Object persistence
      

    

** Concise Permissions

   Uberallfs implements a set of /concise permissions/ unlike traditional 'rwx' Unix
   permissions with their overloaded meaning for directories.

   These permissions are mapped onto the available permissions of the target operating
   system. Permissions are tied to (lists of) public keys. There are no users and groups
   otherwise. There is one special (all zero?) Key which means 'anyone'.

   A permission which would allow full access (including deleting/overwriting) all data also
   allows a node to take authority over an object. Nodes which can't gain authority over an
   object must pass their mutations to the authoritative node where they will be validated.

   Access control is inclusive, when one could gain access because the key is listed in the
   respective Admin list, then one gets that permission implicitly.

*** File Permissions

    File permission are initially relatively simple, only 'append' added over unix
    permissions. Should be self explanatory.

    * read ::
    * write ::
      This is the *authoritative* permission.
    * append ::

*** Directory Permissions

    *WIP!*

    With directories things become more complicated.

    * list ::
      Allow listing of the directory filenames.
      (purely know they exists, no object identifiers)
    * list-accessible ::
      Listing is filtered to content where one has (any) access to.
    * list-authoritative ::
      Listing is filtered to content where one has authority for.
    * read ::
      Allow listing of the directory content including object identifiers.
    * read-accessible ::
      Listing is filtered to content where one has (any) access to.
    * read-authoritative ::
      Listing is filtered to content where one has authority for.
    * add ::
      Add new objects.
    * add-authoritative ::
      Only add objects where one is authoritative for.
    * add-anonymous ::
      Add anonymous objects.
    * rename ::
      Rename an object within the same directory. Moving objects across directories are
      handled like add/delete on each directory.
    * rename-authoritative ::
      Rename an object within the same directory where one is authoritative for.
    * rename-anonymous ::
      Rename an anonymous object within the same directory.
    * delete ::
      Delete any object.
      This is the *authoritative* permission.
    * delete-authoritative ::
      Delete objects where one is authoritative for.
    * delete-anonymous ::
      Delete anonymous objects.

    Further rules can be defined how objects are created, what extra permissions and keys apply (inherit from directory,..)

* The Node
  :PROPERTIES:
  :CUSTOM_ID: d2f3ef15-6e9a-4cae-9131-1534664ffa98
  :END:

  
** Planned

*** Realms

* HowTo
  :PROPERTIES:
  :CUSTOM_ID: ead96b87-abaf-43e6-89a8-111b9a8799d3
  :END:

  WIP: Envisioned usage

  Examples here using defaults for most options. Defaults should always be the be safe option.

** Plumbing vs Porcelain

   This examples starting with 'plumbing' commands to show the steps involved to set something
   up. When applicable 'porcelain' is added next to it, in general porcelain commands simplify
   usage, but depend on some preconditions, like that the filesystem is already set up and
   mounted (unless for the setup commands).

*** Initialize and start a new uberallfs node

