doc/UBERALLFS.md

1.  With private root

        $ uberallfs objectstore ./DIR_A init
        $ uberallfs node ./DIR_A init
        $ uberallfs node ./DIR_A start
        $ uberallfs fuse ./DIR_A mount
    
        $ uberallfs init ./DIR_A
        $ uberallfs start ./DIR_A
    
    Will result in a uberallfs mounted on './DIR<sub>A</sub>' with a private (by default) root
    directory.

2.  Make a Directory shareable

    We created a 'private' root directory in the previous step. For being used as distributed
    directory its type must be changed.
    
        $ uberallfs objectstore ./DIR_A chtype public_mutable /
    
    This changes the type and sets up a minimal ACL to make the executing user Creator of the
    object.
    
    Porcelain will only work on a running (mounted) filesystem.
    
        $ uberallfs chtype public_mutable ./DIR_A

3.  Shared Root Dir

    The root directory is nothing special an can be shared as any other object, the only
    difference is that the root directory must be present in the objectstore for almost all
    other operations (like mounting the file system). Thus objectstore initialization can
    already takes care for setting up the root directory.
    
    On the new filesystem the node must be initialized first for exporting the (default
    generated) users public key.
    
        $ uberallfs node ./DIR_B init
        $ uberallfs node ./DIR_B export-key
        base64encodedpubkey
    
        $ uberallfs node ./DIR_B init
        $ uberallfs export_key ./DIR_B
        base64encodedpubkey
    
    -   By exported Directory
        
        Give the new user/key access to the root directory in './DIR<sub>A</sub>' and export it into an
        archive. This thin export only contains the minimum necessary metadata to reconstruct
        the content by querying the original node.
        
            $ uberallfs objectstore ./DIR_A chacl +super_admin base64encodedpubkey /
            $ uberallfs objectstore ./DIR_A send --thin / >ARCHIVE
        
            $ uberallfs chacl +super_admin base64encodedpubkey /DIR_A
            $ uberallfs export ./DIR_A ARCHIVE
        
        Now we can import that archive as new root directory and go on.
        
            $ uberallfs objectstore ./DIR_B init --import ARCHIVE
            $ uberallfs node ./DIR_B start
            $ uberallfs fuse ./DIR_B mount
        
            $ uberallfs import --root ARCHIVE ./DIR_B
            $ uberallfs start ./DIR_B
    
    -   By URL
        
        Instead importing an ARCHIVE one can also supply a URL the root dir will then be
        fetched over the network.
        
        The an URL has the form 'uberallfs://host:port/identifier' and can be shown by:
        
            $ uberallfs node ./DIR_A show --url /
            uberallfs://localhost:port/base64encodedidentifier
        
            $ uberallfs show-url ./DIR_A
            uberallfs://localhost:port/base64encodedidentifier
        
        This URL can then be used to bootstrap the new objectstore
        
            $ uberallfs objectstore ./DIR_B init --no-root
            $ uberallfs node ./DIR_B start
            $ uberallfs node ./DIR_B fetch uberallfs://localhost:port/base64encodedidentifier
            $ uberallfs objectstore ./DIR_B root --set base64encodedidentifier
            $ uberallfs fuse ./DIR_B mount
        
        'insta' does all DWIM magic to get a uberallfs running. initialization, starting and
        mounting the node. Possibly it asks some interactive questions (for deploying keys).
        An existing dir will be reused if no data gets overwritten (same root again).
        
            $ uberallfs insta ./DIR_B --from uberallfs://localhost:port/base64encodedidentifier


<a id="org4b07c2b"></a>

# Problems/Solutions


<a id="orga8cc0d6"></a>

## Distributed object deletion

Objects may be referenced from different locations all over the network. Deleting a object
from a directory is as simple as just remove it from there when one has authority over the
directory. But this does not mean the Object itself can be removed from the object store
since other nodes may still refer to it.

-   **Solutions:** -   When no parts of the object are locally authoritative (no data!) then it can be removed.
    -   Every Object has a 'grace' time for which it will be kept with a 'deleted' flag. Once
        this grace time is expired it can be deleted.
        
        -   Any other node which references this object should poll the object within this grace
            time. When the authoritative node responds that the object ought to be deleted then
            -   Node without full access are advised to synchronize the object
            -   Nodes with full access are advised to adopt the object.
                -   Once adopted and all data is transferred the **data** can deleted. Metadata (trail)
                    needs to stay alive until the grace time is expired.
        
        This grace time can be exponential, starting from for example 30 seconds, doubling on
        every expire where the object is still in use up to some upper limit.

